## Airthmetic Operation:

In [1]:
mport pandas as pd 
var = pd.DataFrame({"A":[1,2,3,4],"B":[2,6,9,8]})
var

   A  B
0  1  2
1  2  6
2  3  9
3  4  8

# Addition:

In [3]:
var["c"] = var["A"] + var["B"]
var

   A  B   c
0  1  2   3
1  2  6   8
2  3  9  12
3  4  8  12

# Substract:

In [5]:
var["c"] = var["A"] - var["B"]
var

   A  B  c
0  1  2 -1
1  2  6 -4
2  3  9 -6
3  4  8 -4

# Multiple:

In [7]:
var["c"] = var["A"] * var["B"]
var

   A  B   c
0  1  2   2
1  2  6  12
2  3  9  27
3  4  8  32

# Devide:

In [9]:
var["c"] = var["A"] / var["B"]
var

   A  B         c
0  1  2  0.500000
1  2  6  0.333333
2  3  9  0.333333
3  4  8  0.500000

# Get true and false data in column:

In [27]:
import pandas as pd 
var1 = pd.DataFrame({"A":[10,20,30,40],"B":[12,16,19,18]})
var1

    A   B
0  10  12
1  20  16
2  30  19
3  40  18

In [29]:
var1["python"] = var1["A"]>=20
var1

    A   B  python
0  10  12   False
1  20  16    True
2  30  19    True
3  40  18    True

In [31]:
var1["python"] = var1["A"]<=20
var1

    A   B  python
0  10  12    True
1  20  16    True
2  30  19   False
3  40  18   False

### Delete and Insert Data:

# insert

In [1]:
import pandas as pd
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,89,9,0],"C":[5,5,8,58,2]})
var

   A   B   C
0  1   6   5
1  2   7   5
2  3  89   8
3  4   9  58
4  5   0   2

In [12]:
var.insert(1,"py",var["A"])
var

   A  py  python   B
0  1   1       1   6
1  2   2       2   7
2  3   3       3  89
3  4   4       4   9
4  5   5       5   0

In [16]:
var["paras"]=var["A"][:3]
var

   A  py  python   B  paras
0  1   1       1   6    1.0
1  2   2       2   7    2.0
2  3   3       3  89    3.0
3  4   4       4   9    NaN
4  5   5       5   0    NaN

# delete

In [10]:
import pandas as pd
var=pd.DataFrame({"A":[1,2,3,4,5],"B":[6,7,89,9,0],"C":[5,5,8,58,2]})
var

   A   B   C
0  1   6   5
1  2   7   5
2  3  89   8
3  4   9  58
4  5   0   2

In [12]:
var2= var.pop("B")
var2

0     6
1     7
2    89
3     9
4     0
Name: B, dtype: int64

In [14]:
var

   A   C
0  1   5
1  2   5
2  3   8
3  4  58
4  5   2